Revit 2027 API
AnalysisDisplayStyle.HasDeformedShapeSettings Method
 If true style has deformed shape settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDeformedShapeSettings()
Public Function HasDeformedShapeSettings As Boolean
public:
bool HasDeformedShapeSettings()
member HasDeformedShapeSettings : unit -> bool
Return Value
Boolean
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace